Data Manipulation and Analysis 

Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform, and extract insights from data.

In [2]:
import pandas as pd

df = pd.read_csv('data.csv')

##fetch the first 5 rows
df.head(5)

   Name  Age           City
0  John   30       New York
1  Anna   22         London
2  Mike   32  San Francisco

In [3]:
df.tail(5)

   Name  Age           City
0  John   30       New York
1  Anna   22         London
2  Mike   32  San Francisco

In [4]:
df.describe() # summary statistics

             Age
count   3.000000
mean   28.000000
std     5.291503
min    22.000000
25%    26.000000
50%    30.000000
75%    31.000000
max    32.000000

In [6]:
df.dtypes # data types of each column

Name    object
Age      int64
City    object
dtype: object

In [7]:
##Handling missing values
df.isnull().sum() # check for missing values

Name    0
Age     0
City    0
dtype: int64

In [ ]:
#Renaming columns
df.rename(columns={'old_name': 'new_name'}, inplace=True)

In [ ]:
##change dtype of a column
df['column_name'] = df['column_name'].astype('int') # change to int
df.head()

In [ ]:
##change data types
df['column_name'] = df['column_name'].fillna(df['column_name'].mean()).astype(int) # fill missing values with mean
df.head()

In [ ]:
df['New Value'] = df['column_name'].apply(lambda x: x + 1) # add 1 to each value in the column
df.head()

In [ ]:
##Data aggregation and grouping

grouped_mean = df.groupby('column_name').mean() # group by column_name and calculate mean

In [ ]:
##merging dataframes
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6]})
merged_df = pd.merge(df1, df2, on='key', how='inner') # inner join
merged_df = pd.merge(df1, df2, on='key', how='outer') # outer join  
merged_df = pd.merge(df1, df2, on='key', how='left') # left join
merged_df = pd.merge(df1, df2, on='key', how='right') # right join